Repository: William-Fernandes252/loan-default-prediction
Catalog: experimentos/locales/*/LC_MESSAGES/*.po
Languages: pt_br

source: Stability Analysis: {metric_name} - {dataset_name}
pt_br: Análise de Estabilidade: {metric_name} - {dataset_name}

source: Handling Technique
pt_br: Técnica de Tratamento

source: Precision-Recall Trade-off (Mean over {num_seeds} seeds) - {dataset_name}
pt_br: Compromisso Precisão-Revocação (Média de {num_seeds} sementes) - {dataset_name}

source: Recall (Sensitivity) - Ability to detect defaults
pt_br: Revocação (Sensibilidade) - Capacidade de detectar inadimplência

source: Precision - Trustworthiness of default prediction
pt_br: Precisão - Confiabilidade da previsão de inadimplência

source: {metric_name} vs. Imbalance Ratio - {dataset_name}
pt_br: {metric_name} vs. Razão de Desbalanceamento - {dataset_name}

source: Imbalance Ratio (Majority/Minority) - Log Scale
pt_br: Razão de Desbalanceamento (Majoritária/Minoritária) - Escala Log

source: Cost-Sensitive vs Resampling Performance - {dataset_name}
pt_br: Desempenho Custo-Sensível vs Reamostragem - {dataset_name}

source: Technique
pt_br: Técnica

source: Effect of {param} on ROC AUC - {dataset_name}
pt_br: Efeito de {param} no ROC AUC - {dataset_name}

source: {param} (Log Scale if numeric)
pt_br: {param} (Escala Log se numérico)

source: Model
pt_br: Modelo

source: Corporate Credit Rating
pt_br: Classificação de Crédito Corporativo

source: Taiwan Credit
pt_br: Crédito de Taiwan

source: Support Vector Machine
pt_br: Máquina de Vetores de Suporte

source: Multi-Layer Perceptron
pt_br: Perceptron Multicamadas

source: Baseline
pt_br: Linha de Base

source: Random Under Sampling
pt_br: Subamostragem Aleatória

source: Cost-sensitive SVM
pt_br: SVM Custo-Sensível

source: Precision
pt_br: Precisão

source: Recall
pt_br: Revocação

source: Sensitivity
pt_br: Sensibilidade

source: Balanced Accuracy
pt_br: Acurácia Balanceada
